<a href="https://colab.research.google.com/github/VampireRide/BD/blob/main/preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [17]:
import pandas as pd

In [18]:
practicals = pd.read_csv("practicals.csv")

In [19]:
practicals.head()

  Farmer_ID Gender Property_Area  ...  Quantity in KG  Unnamed: 6  Farmer Education
0   F001002   Male         Urban  ...             115         NaN          Graduate
1   F001003   Male         Rural  ...             128         NaN          Graduate
2   F001004   Male         Urban  ...              66         NaN          Graduate
3   F001005   Male         Urban  ...             120         NaN      Not Graduate
4   F001006   Male         Urban  ...             141         NaN          Graduate

[5 rows x 8 columns]

In [20]:
practicals.tail()

   Farmer_ID  Gender Property_Area  ...  Quantity in KG  Unnamed: 6  Farmer Education
14   F001016    Male         Urban  ...              17         NaN          Graduate
15   F001017    Male         Urban  ...             125         NaN          Graduate
16   F001018    Male         Urban  ...             100         NaN      Not Graduate
17   F001019  Female         Urban  ...              76         NaN          Graduate
18   F001020    Male         Rural  ...             133         NaN      Not Graduate

[5 rows x 8 columns]

In [21]:
practicals.describe()

       Property in sq.ft         Seeds  Quantity in KG  Unnamed: 6
count          19.000000     19.000000       19.000000         0.0
mean         4132.421053   3329.473684      134.263158         NaN
std          2495.103234   2703.908948       74.609980         NaN
min          1299.000000    700.000000       17.000000         NaN
25%          2791.500000   1512.000000       97.500000         NaN
50%          3510.000000   2358.000000      120.000000         NaN
75%          4918.500000   4381.000000      149.500000         NaN
max         12841.000000  10968.000000      349.000000         NaN

In [23]:
practicals.shape

(19, 8)

In [24]:
practicals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Farmer_ID          19 non-null     object
 1   Gender             19 non-null     object
 2   Property_Area      19 non-null     object
 3   Property in sq.ft  19 non-null     int64
 4   Seeds              19 non-null     int64
 5   Quantity in KG     19 non-null     int64
 6   Unnamed: 6         0 non-null      float64
 7   Farmer Education   19 non-null     object
dtypes: float64(1), int64(3), object(4)
memory usage: 1.3+ KB

In [25]:
print(practicals.isnull().sum())

Farmer_ID             0
Gender                0
Property_Area         0
Property in sq.ft     0
Seeds                 0
Quantity in KG        0
Unnamed: 6           19
Farmer Education      0
dtype: int64

In [26]:

practicals.dtypes

Farmer_ID             object
Gender                object
Property_Area         object
Property in sq.ft      int64
Seeds                  int64
Quantity in KG         int64
Unnamed: 6           float64
Farmer Education      object
dtype: object

In [27]:
practicals.dropna(axis = 0, inplace = True)

In [28]:
print(practicals.isnull().sum())

Farmer_ID            0
Gender               0
Property_Area        0
Property in sq.ft    0
Seeds                0
Quantity in KG       0
Unnamed: 6           0
Farmer Education     0
dtype: int64